
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-V14
  * azurerm_key_vault_secret.POSTGRES-USER-V14


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/plumsi-aat"
      + name                    = "recipe-backend-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/plumsi-aat"
      + name                    = "recipe-backend-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":726,"Program":"tfcmt","SHA1":"","Vars":{}} -->